class_colors_hessinheim = {
    0: (34, 139, 34),   # Low Vegetation - Низкая растительность
    1: (128, 128, 128), # Impervious Surface - Непроницаемая поверхность
    2: (255, 0, 0),     # Vehicle - Транспортное средство
    3: (255, 165, 0),   # Urban Furniture - Городская мебель
    4: (0, 0, 255),     # Roof - Крыша
    5: (128, 0, 128),   # Façade - Фасад
    6: (0, 255, 0),     # Shrub - Кустарник
    7: (0, 100, 0),     # Tree - Дерево
    8: (139, 69, 19),   # Soil/Gravel - Почва/Гравий
    9: (64, 224, 208),  # Vertical Surface - Вертикальная поверхность
    10: (255, 255, 0),  # Chimney - Дымоход
}

# class_colors_stpls3d = {
#     0: (0, 0, 0),          # Ground - Черный ----------------
#     1: (0, 255, 0),       # Building - Зеленый -------------------
#     2: (255, 255, 0),     # LowVegetation - Желтый -----------------
#     3: (0, 0, 255),       # MediumVegetation - Синий
#     4: (255, 0, 0),       # HighVegetation - Красный ---------------
#     5: (0, 255, 255),     # Vehicle - Бирюзовый
#     6: (255, 0, 255),     # Truck - Магента
#     7: (255, 128, 0),     # Aircraft - Оранжевый
#     8: (128, 128, 128),   # MilitaryVehicle - Серый
#     9: (255, 20, 147),    # Bike - Deep Pink
#     10: (255, 69, 0),     # Motorcycle - Красный Апельсин
#     11: (210, 180, 140),  # LightPole - Бежевый
#     12: (255, 105, 180),  # StreetSign - Hot Pink
#     13: (165, 42, 42),    # Clutter - Коричневый
#     14: (139, 69, 19),     # Fence - Темно-коричневый
#     15: (128, 0, 128),    # Road - Фиолетовый----------------------------------
#     16: (255, 255, 255),   # Windows - Белый
#     17: (222, 184, 135),   # Dirt - Седой
#     18: (127, 255, 0),     # Grass - Ярко-зеленый ----------------------
# }


class_colors_toronto3D = {
    0: (0, 0, 0),  # Unclassified - Черный
    1: (0, 255, 0),  # Ground - Зеленый
    2: (255, 255, 0),  # Road_markings - Желтый
    3: (0, 0, 255),  # Natural - Синий
    4: (255, 0, 0),  # Building - Красный
    5: (0, 255, 255),  # Utility_line - Бирюзовый
    6: (255, 0, 255),  # Pole - Магента
    7: (255, 128, 0),  # Car - Оранжевый
    8: (128, 128, 128),  # Fence - Серый
}

class_colors_test_1 = {
    0: (0, 0, 0),  # Unclassified - Черный
    1: (255, 255, 255),  # Ground - Белый
}

class_colors_test_2 = {
    0: (0, 0, 0),  # Unclassified - Черный
    1: (255, 255, 255),  # Ground - Белый
    2: (0, 255, 255),  # Ground - Белый
}

# 20 - 1 (16) - 1 (17) - 1 (8) = 17 классов
class_colors_stpls3d = {
    0: (0, 0, 0),  # Ground - Черный
    1: (128, 128, 128),  # Building - Зеленый           1==17
    2: (255, 255, 0),  # LowVegetation - Желтый
    3: (0, 0, 255),  # MediumVegetation - Синий
    4: (255, 0, 0),  # HighVegetation - Красный
    5: (0, 255, 255),  # Vehicle - Бирюзовый
    6: (255, 0, 255),  # Truck - Магента
    7: (255, 128, 0),  # Aircraft - Оранжевый
    9: (255, 20, 147),  # Bike - Deep Pink
    10: (255, 69, 0),  # Motorcycle - Красный Апельсин
    11: (210, 180, 140),  # LightPole - Бежевый
    12: (255, 105, 180),  # StreetSign - Hot Pink
    13: (165, 42, 42),  # Clutter - Коричневый
    14: (139, 69, 19),  # Fence - Темно-коричневый
    15: (128, 0, 128),  # Road - Фиолетовый
    18: (222, 184, 135),  # Dirt - Седой
    19: (127, 255, 0),  # Grass - Ярко-зеленый
}