class_colors_hessinheim = {
    0: (34, 139, 34),   # Low Vegetation - Низкая растительность
    1: (128, 128, 128), # Impervious Surface - Непроницаемая поверхность
    2: (255, 0, 0),     # Vehicle - Транспортное средство
    3: (255, 165, 0),   # Urban Furniture - Городская мебель
    4: (0, 0, 255),     # Roof - Крыша
    5: (128, 0, 128),   # Façade - Фасад
    6: (0, 255, 0),     # Shrub - Кустарник
    7: (0, 100, 0),     # Tree - Дерево
    8: (139, 69, 19),   # Soil/Gravel - Почва/Гравий
    9: (64, 224, 208),  # Vertical Surface - Вертикальная поверхность
    10: (255, 255, 0),  # Chimney - Дымоход
}